package ru.modulkassa.pos.integration.entity.check

/**
 * Тег налоговой ставки
 */
enum class VatTag(val tagValue: Int) {
    /**
     * 1102 – НДС 18%
     */
    TAG_1102(1102),
    /**
     * 1103 – НДС 10%
     */
    TAG_1103(1103),
    /**
     * 1104 – НДС 0%
     */
    TAG_1104(1104),
    /**
     * 1105 – НДС не облагается
     */
    TAG_1105(1105),
    /**
     * 1106 – НДС с рассч. ставкой 18/118
     */
    TAG_1106(1106),
    /**
     * 1107 – НДС с рассч. ставкой 10/110
     */
    TAG_1107(1107);
}